Revit 2026 API

# ElectricalSystemPowerFactor Property

---

The PowerFactor value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PowerFactor { get; }
```
```vb
Public ReadOnly Property PowerFactor As Double
	Get
```
```cpp
public:
property double PowerFactor {
	double get ();
}
```
```fsharp
member PowerFactor : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the PowerFactor value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace